<?xml version="1.0" ?>
<net batch="1" name="model" version="2">
	<layers>
		<layer id="0" name="data" precision="FP32" type="Input">
			<output>
				<port id="0">
					<dim>4</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</output>
		</layer>
		<layer id="1" name="conv1/7x7_s2" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="7" kernel-y="7" output="64" pad-x="3" pad-y="3" stride="1,1,2,2" stride-x="2" stride-y="2"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>3</dim>
					<dim>300</dim>
					<dim>300</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>64</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
			<blobs>
				<weights offset="0" size="37632"/>
				<biases offset="37632" size="256"/>
			</blobs>
		</layer>
		<layer id="2" name="conv1/7x7_s2/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</output>
		</layer>
		<layer id="3" name="pool1/3x3_s2" precision="FP32" type="Pooling">
			<data exclude-pad="false" kernel-x="3" kernel-y="3" pad-x="0" pad-y="0" pool-method="max" rounding_type="ceil" stride="1,1,2,2" stride-x="2" stride-y="2"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>150</dim>
					<dim>150</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="4" name="conv2/3x3_reduce" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>64</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<weights offset="37888" size="16384"/>
				<biases offset="54272" size="256"/>
			</blobs>
		</layer>
		<layer id="5" name="conv2/3x3_reduce/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="6" name="conv2/3x3" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="192" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>192</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
			<blobs>
				<weights offset="54528" size="442368"/>
				<biases offset="496896" size="768"/>
			</blobs>
		</layer>
		<layer id="7" name="conv2/3x3/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>192</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>192</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</output>
		</layer>
		<layer id="8" name="pool2/3x3_s2" precision="FP32" type="Pooling">
			<data exclude-pad="false" kernel-x="3" kernel-y="3" pad-x="0" pad-y="0" pool-method="max" rounding_type="ceil" stride="1,1,2,2" stride-x="2" stride-y="2"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>192</dim>
					<dim>75</dim>
					<dim>75</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>192</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="9" name="inception_3a/1x1" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>192</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="497664" size="49152"/>
				<biases offset="546816" size="256"/>
			</blobs>
		</layer>
		<layer id="10" name="inception_3a/1x1/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="11" name="inception_3a/3x3_reduce" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>192</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="547072" size="49152"/>
				<biases offset="596224" size="256"/>
			</blobs>
		</layer>
		<layer id="12" name="inception_3a/3x3_reduce/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="13" name="inception_3a/3x3" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="64" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="596480" size="147456"/>
				<biases offset="743936" size="256"/>
			</blobs>
		</layer>
		<layer id="14" name="inception_3a/3x3/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="15" name="inception_3a/double3x3_reduce" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>192</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="744192" size="49152"/>
				<biases offset="793344" size="256"/>
			</blobs>
		</layer>
		<layer id="16" name="inception_3a/double3x3_reduce/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="17" name="inception_3a/double3x3a" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="96" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="793600" size="221184"/>
				<biases offset="1014784" size="384"/>
			</blobs>
		</layer>
		<layer id="18" name="inception_3a/double3x3a/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="19" name="inception_3a/double3x3b" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="96" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1015168" size="331776"/>
				<biases offset="1346944" size="384"/>
			</blobs>
		</layer>
		<layer id="20" name="inception_3a/double3x3b/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="21" name="inception_3a/pool" precision="FP32" type="Pooling">
			<data exclude-pad="false" kernel-x="3" kernel-y="3" pad-x="1" pad-y="1" pool-method="avg" rounding_type="ceil" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>192</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>192</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="22" name="inception_3a/pool_proj" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="32" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>192</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>32</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1347328" size="24576"/>
				<biases offset="1371904" size="128"/>
			</blobs>
		</layer>
		<layer id="23" name="inception_3a/pool_proj/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>32</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>32</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="24" name="inception_3a/output" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="2">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="3">
					<dim>4</dim>
					<dim>32</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>4</dim>
					<dim>256</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="25" name="inception_3b/1x1" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>256</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1372032" size="65536"/>
				<biases offset="1437568" size="256"/>
			</blobs>
		</layer>
		<layer id="26" name="inception_3b/1x1/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="27" name="inception_3b/3x3_reduce" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>256</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1437824" size="65536"/>
				<biases offset="1503360" size="256"/>
			</blobs>
		</layer>
		<layer id="28" name="inception_3b/3x3_reduce/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="29" name="inception_3b/3x3" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="96" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1503616" size="221184"/>
				<biases offset="1724800" size="384"/>
			</blobs>
		</layer>
		<layer id="30" name="inception_3b/3x3/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="31" name="inception_3b/double3x3_reduce" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>256</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1725184" size="65536"/>
				<biases offset="1790720" size="256"/>
			</blobs>
		</layer>
		<layer id="32" name="inception_3b/double3x3_reduce/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="33" name="inception_3b/double3x3a" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="96" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="1790976" size="221184"/>
				<biases offset="2012160" size="384"/>
			</blobs>
		</layer>
		<layer id="34" name="inception_3b/double3x3a/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="35" name="inception_3b/double3x3b" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="96" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2012544" size="331776"/>
				<biases offset="2344320" size="384"/>
			</blobs>
		</layer>
		<layer id="36" name="inception_3b/double3x3b/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="37" name="inception_3b/pool" precision="FP32" type="Pooling">
			<data exclude-pad="false" kernel-x="3" kernel-y="3" pad-x="1" pad-y="1" pool-method="avg" rounding_type="ceil" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>256</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>256</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="38" name="inception_3b/pool_proj" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>256</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2344704" size="65536"/>
				<biases offset="2410240" size="256"/>
			</blobs>
		</layer>
		<layer id="39" name="inception_3b/pool_proj/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="40" name="inception_3b/output" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="2">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
				<port id="3">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>4</dim>
					<dim>320</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="41" name="conv4_3_norm_mbox_loc" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="16" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>320</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>16</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2410496" size="184320"/>
				<biases offset="2594816" size="64"/>
			</blobs>
		</layer>
		<layer id="42" name="conv4_3_norm_mbox_loc_perm" precision="FP32" type="Permute">
			<data order="0,2,3,1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>16</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>16</dim>
				</port>
			</output>
		</layer>
		<layer id="43" name="conv4_3_norm_mbox_loc_flat" precision="FP32" type="Flatten">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>37</dim>
					<dim>37</dim>
					<dim>16</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>21904</dim>
				</port>
			</output>
		</layer>
		<layer id="44" name="inception_3c/3x3_reduce" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="128" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>320</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>128</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2594880" size="163840"/>
				<biases offset="2758720" size="512"/>
			</blobs>
		</layer>
		<layer id="45" name="inception_3c/3x3_reduce/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="46" name="inception_3c/3x3" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="160" pad-x="0" pad-y="0" stride="1,1,2,2" stride-x="2" stride-y="2"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>160</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="2759232" size="737280"/>
				<biases offset="3496512" size="640"/>
			</blobs>
		</layer>
		<layer id="47" name="inception_3c/3x3/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>160</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>160</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="48" name="inception_3c/double3x3_reduce" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>320</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3497152" size="81920"/>
				<biases offset="3579072" size="256"/>
			</blobs>
		</layer>
		<layer id="49" name="inception_3c/double3x3_reduce/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="50" name="inception_3c/double3x3a" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="96" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3579328" size="221184"/>
				<biases offset="3800512" size="384"/>
			</blobs>
		</layer>
		<layer id="51" name="inception_3c/double3x3a/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</output>
		</layer>
		<layer id="52" name="inception_3c/double3x3b" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="96" pad-x="0" pad-y="0" stride="1,1,2,2" stride-x="2" stride-y="2"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="3800896" size="331776"/>
				<biases offset="4132672" size="384"/>
			</blobs>
		</layer>
		<layer id="53" name="inception_3c/double3x3b/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="54" name="inception_3c/pool" precision="FP32" type="Pooling">
			<data exclude-pad="false" kernel-x="3" kernel-y="3" pad-x="0" pad-y="0" pool-method="max" rounding_type="ceil" stride="1,1,2,2" stride-x="2" stride-y="2"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>320</dim>
					<dim>37</dim>
					<dim>37</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>320</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="55" name="inception_3c/output" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>160</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="2">
					<dim>4</dim>
					<dim>320</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="56" name="inception_4a/1x1" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="224" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>224</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4133056" size="516096"/>
				<biases offset="4649152" size="896"/>
			</blobs>
		</layer>
		<layer id="57" name="inception_4a/1x1/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>224</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>224</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="58" name="inception_4a/3x3_reduce" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="64" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4650048" size="147456"/>
				<biases offset="4797504" size="256"/>
			</blobs>
		</layer>
		<layer id="59" name="inception_4a/3x3_reduce/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="60" name="inception_4a/3x3" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="96" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>64</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="4797760" size="221184"/>
				<biases offset="5018944" size="384"/>
			</blobs>
		</layer>
		<layer id="61" name="inception_4a/3x3/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="62" name="inception_4a/double3x3_reduce" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="96" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5019328" size="221184"/>
				<biases offset="5240512" size="384"/>
			</blobs>
		</layer>
		<layer id="63" name="inception_4a/double3x3_reduce/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="64" name="inception_4a/double3x3a" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="128" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5240896" size="442368"/>
				<biases offset="5683264" size="512"/>
			</blobs>
		</layer>
		<layer id="65" name="inception_4a/double3x3a/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="66" name="inception_4a/double3x3b" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="128" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="5683776" size="589824"/>
				<biases offset="6273600" size="512"/>
			</blobs>
		</layer>
		<layer id="67" name="inception_4a/double3x3b/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="68" name="inception_4a/pool" precision="FP32" type="Pooling">
			<data exclude-pad="false" kernel-x="3" kernel-y="3" pad-x="1" pad-y="1" pool-method="avg" rounding_type="ceil" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="69" name="inception_4a/pool_proj" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="128" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6274112" size="294912"/>
				<biases offset="6569024" size="512"/>
			</blobs>
		</layer>
		<layer id="70" name="inception_4a/pool_proj/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="71" name="inception_4a/output" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>224</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="2">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="3">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="72" name="inception_4b/1x1" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="192" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="6569536" size="442368"/>
				<biases offset="7011904" size="768"/>
			</blobs>
		</layer>
		<layer id="73" name="inception_4b/1x1/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="74" name="inception_4b/3x3_reduce" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="96" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7012672" size="221184"/>
				<biases offset="7233856" size="384"/>
			</blobs>
		</layer>
		<layer id="75" name="inception_4b/3x3_reduce/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="76" name="inception_4b/3x3" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="128" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7234240" size="442368"/>
				<biases offset="7676608" size="512"/>
			</blobs>
		</layer>
		<layer id="77" name="inception_4b/3x3/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="78" name="inception_4b/double3x3_reduce" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="96" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7677120" size="221184"/>
				<biases offset="7898304" size="384"/>
			</blobs>
		</layer>
		<layer id="79" name="inception_4b/double3x3_reduce/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="80" name="inception_4b/double3x3a" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="128" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>96</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="7898688" size="442368"/>
				<biases offset="8341056" size="512"/>
			</blobs>
		</layer>
		<layer id="81" name="inception_4b/double3x3a/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="82" name="inception_4b/double3x3b" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="128" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8341568" size="589824"/>
				<biases offset="8931392" size="512"/>
			</blobs>
		</layer>
		<layer id="83" name="inception_4b/double3x3b/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="84" name="inception_4b/pool" precision="FP32" type="Pooling">
			<data exclude-pad="false" kernel-x="3" kernel-y="3" pad-x="1" pad-y="1" pool-method="avg" rounding_type="ceil" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="85" name="inception_4b/pool_proj" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="128" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="8931904" size="294912"/>
				<biases offset="9226816" size="512"/>
			</blobs>
		</layer>
		<layer id="86" name="inception_4b/pool_proj/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="87" name="inception_4b/output" precision="FP32" type="Concat">
			<data axis="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>192</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="2">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
				<port id="3">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="4">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="88" name="inception_4c/1x1" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="160" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>160</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9227328" size="368640"/>
				<biases offset="9595968" size="640"/>
			</blobs>
		</layer>
		<layer id="89" name="inception_4c/1x1/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>160</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>160</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="90" name="inception_4c/3x3_reduce" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="128" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9596608" size="294912"/>
				<biases offset="9891520" size="512"/>
			</blobs>
		</layer>
		<layer id="91" name="inception_4c/3x3_reduce/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="92" name="inception_4c/3x3" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="3" kernel-y="3" output="160" pad-x="1" pad-y="1" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>160</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="9892032" size="737280"/>
				<biases offset="10629312" size="640"/>
			</blobs>
		</layer>
		<layer id="93" name="inception_4c/3x3/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>160</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
					<dim>4</dim>
					<dim>160</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
		</layer>
		<layer id="94" name="inception_4c/double3x3_reduce" precision="FP32" type="Convolution">
			<data dilation-x="1" dilation-y="1" group="1" kernel-x="1" kernel-y="1" output="128" pad-x="0" pad-y="0" stride="1,1,1,1" stride-x="1" stride-y="1"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>576</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="3">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</output>
			<blobs>
				<weights offset="10629952" size="294912"/>
				<biases offset="10924864" size="512"/>
			</blobs>
		</layer>
		<layer id="95" name="inception_4c/double3x3_reduce/bn/sc/relu" precision="FP32" type="ReLU">
			<data engine="caffe.ReLUParameter.DEFAULT" negative_slope="0.0"/>
			<input>
				<port id="0">
					<dim>4</dim>
					<dim>128</dim>
					<dim>18</dim>
					<dim>18</dim>
				</port>
			</input>
			<output>
				<port id="1">
